[
  { 
    "nombreEmpresa": "Universidad Nacional Autónoma de México (UNAM)",
    "descripcionPuesto": {
      "esp": "Programador web en el área de servicios escolares de la facultad de economía.",
      "eng": "Web programmer in the school services area of the Faculty of Economics"
    },
    "periodo": {
      "esp": "De enero a mayo del 2021.",
      "eng": "From January to May 2021."
    },
    "actividadesRealizadas": {
      "esp": [
        "Desarrollo de aplicación para la evaluación docente usando Laravel.",
        "Uso de PosgreSQL para almacenamiento de los registros en bases de datos de tipo relacional."
      ],
      "eng": [
        "Development of an application for teacher evaluation using Laravel.",
        "Usage of PostgreSQL for storing records in relational databases."
      ]
    },
    "ubicacion": {
      "lat": 19.33471,
      "lng":  -99.18401
    }
  },
  { 
    "nombreEmpresa": "IOS Comunicaciones y servicios S.A de C.V.",
    "descripcionPuesto": {
      "esp": "Programador Jr en el área de sistemas.",
      "eng": "Jr Programmer in systems area."
    },
    "periodo": {
      "esp": "De junio del 2021 a octubre del 2022.",
      "eng": "From June 2021 to October 2022."
    },
    "actividadesRealizadas": {
      "esp": [
        "Desarrollo de aplicación tanto móvil (react native y flutter) como web (Vuejs 3).",
        "Uso de funciones CRUD empleando Firebase y Realtime Database en bases de datos no relacionales.",
        "Creación de reportes provenientes de la base de datos.",
        "Creación de páginas web utilizando la herramienta Wordpress."
      ],
      "eng": [
        "Development of both mobile applications (React Native and Flutter) and web applications (Vue.js 3).",
        "Utilization of CRUD functions employing Firebase and Realtime Database in non-relational databases.",
        "Generation of reports from the database.",
        "Creation of web pages using the Wordpress tool."
      ]
    },
    "ubicacion": {
      "lat": 19.29272985610601,
      "lng": -99.21741427668093
    }
  },
  { 
    "nombreEmpresa": "Huawei Technologies de Mexico",
    "descripcionPuesto": {
      "esp": "IT Engineer en el área de quality operations.",
      "eng": "IT Engineer in quality operations area"
    },
    "periodo": {
      "esp": "De diciembre del 2022 a febrero del 2024.",
      "eng": "From December 2022 to February 2024."
    },
    "actividadesRealizadas": {
      "esp": [
        "Diseño y desarrollo de paginas web para procesos internos de la empresa usando Vuejs 2.",
        "Creacion de RPA's para la automatización de tareas utilizando Selenium.",
        "Análisis, depuración y creación de reportes automatizados mediante Python usando la librería Pandas.",
        "Aplicación de la metodología SCRUM."
      ],
      "eng": [
        "Design and development of web pages for internal company processes using Vue.js 2.",
        "Creation of RPA's for task automation using Selenium.",
        "Analysis, debugging, and creation of automated reports using Python with the Pandas library.",
        "Application of the SCRUM methodology."
      ]
    },
    "ubicacion": {
      "lat": 19.361079265123898,
      "lng": -99.26773606339196
    }
  }
]